## Demo - SQL operations using Python MySQL

The first step in interacting with a MySQL server is to establish a connection. To do this, you need connect() from the mysql.connector module. This function takes in parameters like host, user, and password and returns a MySQLConnection object. You can receive these credentials as input from the user and pass them to connect():

In [4]:
import mysql.connector
from mysql.connector import connect, Error

try:
    with connect(
        host="localhost",
        user="root",
        password="",
    ) as connection:
        print(connection)
except Error as e:
    print(e)

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000019B21362560>

Now we will create a new database called online_movie_rating

In [7]:
from mysql.connector import connect, Error

try:
    with connect(
        host="localhost",
        user="root",
        password="",
    ) as connection:
        create_db_query = "CREATE DATABASE online_movie_rating"
        with connection.cursor() as cursor:
            cursor.execute(create_db_query)
except Error as e:
    print(e)

1007 (HY000): Can't create database 'online_movie_rating'; database exists

Run the following script to check if your database is created. In the output section, we can see the newly created DB.

In [8]:
show_db_query = "SHOW DATABASES"
db = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password=""
)
cursor = db.cursor()
cursor.execute(show_db_query)

databases = cursor.fetchall()
print(databases)

[('applog',), ('information_schema',), ('mysql',), ('online_movie_rating',), ('performance_schema',), ('phpmyadmin',), ('test',)]

Now we will create three tables: movies, reviewers, and ratings.

In [10]:
create_movies_table_query = """
CREATE TABLE movies(
    id INT AUTO_INCREMENT PRIMARY KEY,
    title VARCHAR(100),
    release_year YEAR(4),
    genre VARCHAR(100),
    collection_in_mil INT
)
"""
db = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password="",
    database="online_movie_rating"
)
cursor = db.cursor()
cursor.execute(create_movies_table_query)

In [11]:
create_reviewers_table_query = """
CREATE TABLE reviewers (
    id INT AUTO_INCREMENT PRIMARY KEY,
    first_name VARCHAR(100),
    last_name VARCHAR(100)
)
"""
db = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password="",
    database="online_movie_rating"
)
cursor = db.cursor()
cursor.execute(create_reviewers_table_query)

In [12]:
create_ratings_table_query = """
CREATE TABLE ratings (
    movie_id INT,
    reviewer_id INT,
    rating DECIMAL(2,1),
    FOREIGN KEY(movie_id) REFERENCES movies(id),
    FOREIGN KEY(reviewer_id) REFERENCES reviewers(id),
    PRIMARY KEY(movie_id, reviewer_id)
)
"""
db = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password="",
    database="online_movie_rating"
)
cursor = db.cursor()
cursor.execute(create_ratings_table_query)

To check the schema of movies table, run the below script.

In [13]:
show_table_query = "DESCRIBE movies"

cursor = db.cursor()
cursor.execute(show_table_query)
print(cursor.fetchall())

[('id', 'int(11)', 'NO', 'PRI', None, 'auto_increment'), ('title', 'varchar(100)', 'YES', '', None, ''), ('release_year', 'year(4)', 'YES', '', None, ''), ('genre', 'varchar(100)', 'YES', '', None, ''), ('collection_in_mil', 'int(11)', 'YES', '', None, '')]

Now we want to modify the collection_in_mil column and change its type from int to decimal.

In [14]:
alter_table_query = """
ALTER TABLE movies
MODIFY COLUMN collection_in_mil DECIMAL(4,1)
"""
cursor.execute(alter_table_query)
cursor.execute("DESCRIBE movies")

result = cursor.fetchall()
for row in result:
    print(row)

('id', 'int(11)', 'NO', 'PRI', None, 'auto_increment')
('title', 'varchar(100)', 'YES', '', None, '')
('release_year', 'year(4)', 'YES', '', None, '')
('genre', 'varchar(100)', 'YES', '', None, '')
('collection_in_mil', 'decimal(4,1)', 'YES', '', None, '')

Now let's see how to drop a table. First we will see the names of existing tables:

In [15]:
cursor.execute("SHOW TABLES")
tables = cursor.fetchall()
for table in tables:
    print(table)

('movies',)
('ratings',)
('reviewers',)

Run the below command to drop table 'ratings'. You can see in the output section that ratings table has been removed.

In [16]:
drop_table_query = "DROP TABLE ratings"
cursor.execute(drop_table_query)
cursor.execute("SHOW TABLES")
tables = cursor.fetchall()
for table in tables:
    print(table)

('movies',)
('reviewers',)

Inserting values in the movies table. Here we have data for 30 movies.

In [17]:
insert_movies_query = """
INSERT INTO movies (title, release_year, genre, collection_in_mil)
VALUES
    ("Forrest Gump", 1994, "Drama", 330.2),
    ("3 Idiots", 2009, "Drama", 2.4),
    ("Eternal Sunshine of the Spotless Mind", 2004, "Drama", 34.5),
    ("Good Will Hunting", 1997, "Drama", 138.1),
    ("Skyfall", 2012, "Action", 304.6),
    ("Gladiator", 2000, "Action", 188.7),
    ("Black", 2005, "Drama", 3.0),
    ("Titanic", 1997, "Romance", 659.2),
    ("The Shawshank Redemption", 1994, "Drama",28.4),
    ("Udaan", 2010, "Drama", 1.5),
    ("Home Alone", 1990, "Comedy", 286.9),
    ("Casablanca", 1942, "Romance", 1.0),
    ("Avengers: Endgame", 2019, "Action", 858.8),
    ("Night of the Living Dead", 1968, "Horror", 2.5),
    ("The Godfather", 1972, "Crime", 135.6),
    ("Haider", 2014, "Action", 4.2),
    ("Inception", 2010, "Adventure", 293.7),
    ("Evil", 2003, "Horror", 1.3),
    ("Toy Story 4", 2019, "Animation", 434.9),
    ("Air Force One", 1997, "Drama", 138.1),
    ("The Dark Knight", 2008, "Action",535.4),
    ("Bhaag Milkha Bhaag", 2013, "Sport", 4.1),
    ("The Lion King", 1994, "Animation", 423.6),
    ("Pulp Fiction", 1994, "Crime", 108.8),
    ("Kai Po Che", 2013, "Sport", 6.0),
    ("Beasts of No Nation", 2015, "War", 1.4),
    ("Andadhun", 2018, "Thriller", 2.9),
    ("The Silence of the Lambs", 1991, "Crime", 68.2),
    ("Deadpool", 2016, "Action", 363.6),
    ("Drishyam", 2015, "Mystery", 3.0)
"""
cursor.execute(insert_movies_query)
cursor.execute("SELECT * FROM movies")
#print(cursor.fetchall())

records = cursor.fetchall()
for record in records:
    print(record)

(1, 'Forrest Gump', 1994, 'Drama', Decimal('330.2'))
(2, '3 Idiots', 2009, 'Drama', Decimal('2.4'))
(3, 'Eternal Sunshine of the Spotless Mind', 2004, 'Drama', Decimal('34.5'))
(4, 'Good Will Hunting', 1997, 'Drama', Decimal('138.1'))
(5, 'Skyfall', 2012, 'Action', Decimal('304.6'))
(6, 'Gladiator', 2000, 'Action', Decimal('188.7'))
(7, 'Black', 2005, 'Drama', Decimal('3.0'))
(8, 'Titanic', 1997, 'Romance', Decimal('659.2'))
(9, 'The Shawshank Redemption', 1994, 'Drama', Decimal('28.4'))
(10, 'Udaan', 2010, 'Drama', Decimal('1.5'))
(11, 'Home Alone', 1990, 'Comedy', Decimal('286.9'))
(12, 'Casablanca', 1942, 'Romance', Decimal('1.0'))
(13, 'Avengers: Endgame', 2019, 'Action', Decimal('858.8'))
(14, 'Night of the Living Dead', 1968, 'Horror', Decimal('2.5'))
(15, 'The Godfather', 1972, 'Crime', Decimal('135.6'))
(16, 'Haider', 2014, 'Action', Decimal('4.2'))
(17, 'Inception', 2010, 'Adventure', Decimal('293.7'))
(18, 'Evil', 2003, 'Horror', Decimal('1.3'))
(19, 'Toy Story 4', 2019, 'Animation', Decimal('434.9'))
(20, 'Air Force One', 1997, 'Drama', Decimal('138.1'))
(21, 'The Dark Knight', 2008, 'Action', Decimal('535.4'))
(22, 'Bhaag Milkha Bhaag', 2013, 'Sport', Decimal('4.1'))
(23, 'The Lion King', 1994, 'Animation', Decimal('423.6'))
(24, 'Pulp Fiction', 1994, 'Crime', Decimal('108.8'))
(25, 'Kai Po Che', 2013, 'Sport', Decimal('6.0'))
(26, 'Beasts of No Nation', 2015, 'War', Decimal('1.4'))
(27, 'Andadhun', 2018, 'Thriller', Decimal('2.9'))
(28, 'The Silence of the Lambs', 1991, 'Crime', Decimal('68.2'))
(29, 'Deadpool', 2016, 'Action', Decimal('363.6'))
(30, 'Drishyam', 2015, 'Mystery', Decimal('3.0'))

Now we will populate the reviewers table similarly

In [18]:
insert_reviewers_query = """
INSERT INTO reviewers
(first_name, last_name)
VALUES ( %s, %s )
"""
reviewers_records = [
    ("Chaitanya", "Baweja"),
    ("Mary", "Cooper"),
    ("John", "Wayne"),
    ("Thomas", "Stoneman"),
    ("Penny", "Hofstadter"),
    ("Mitchell", "Marsh"),
    ("Wyatt", "Skaggs"),
    ("Andre", "Veiga"),
    ("Sheldon", "Cooper"),
    ("Kimbra", "Masters"),
    ("Kat", "Dennings"),
    ("Bruce", "Wayne"),
    ("Domingo", "Cortes"),
    ("Rajesh", "Koothrappali"),
    ("Ben", "Glocker"),
    ("Mahinder", "Dhoni"),
    ("Akbar", "Khan"),
    ("Howard", "Wolowitz"),
    ("Pinkie", "Petit"),
    ("Gurkaran", "Singh"),
    ("Amy", "Farah Fowler"),
    ("Marlon", "Crafford"),
]

cursor.executemany(insert_reviewers_query, reviewers_records)
cursor.execute("SELECT * FROM reviewers")
#print(cursor.fetchall())

records = cursor.fetchall()
for record in records:
    print(record)

(1, 'Chaitanya', 'Baweja')
(2, 'Mary', 'Cooper')
(3, 'John', 'Wayne')
(4, 'Thomas', 'Stoneman')
(5, 'Penny', 'Hofstadter')
(6, 'Mitchell', 'Marsh')
(7, 'Wyatt', 'Skaggs')
(8, 'Andre', 'Veiga')
(9, 'Sheldon', 'Cooper')
(10, 'Kimbra', 'Masters')
(11, 'Kat', 'Dennings')
(12, 'Bruce', 'Wayne')
(13, 'Domingo', 'Cortes')
(14, 'Rajesh', 'Koothrappali')
(15, 'Ben', 'Glocker')
(16, 'Mahinder', 'Dhoni')
(17, 'Akbar', 'Khan')
(18, 'Howard', 'Wolowitz')
(19, 'Pinkie', 'Petit')
(20, 'Gurkaran', 'Singh')
(21, 'Amy', 'Farah Fowler')
(22, 'Marlon', 'Crafford')

Filter out movies that have genre as 'Drama'.

In [19]:
select_movies_query = """
SELECT *
FROM movies
WHERE genre = 'Drama'
"""
cursor.execute(select_movies_query)
for movie in cursor.fetchall():
    print(movie)

(1, 'Forrest Gump', 1994, 'Drama', Decimal('330.2'))
(2, '3 Idiots', 2009, 'Drama', Decimal('2.4'))
(3, 'Eternal Sunshine of the Spotless Mind', 2004, 'Drama', Decimal('34.5'))
(4, 'Good Will Hunting', 1997, 'Drama', Decimal('138.1'))
(7, 'Black', 2005, 'Drama', Decimal('3.0'))
(9, 'The Shawshank Redemption', 1994, 'Drama', Decimal('28.4'))
(10, 'Udaan', 2010, 'Drama', Decimal('1.5'))
(20, 'Air Force One', 1997, 'Drama', Decimal('138.1'))

Selecting movies based on funds raised in descending order and then displaying the movie name with the release year in brackets.

In [20]:
select_movies_query = """
SELECT CONCAT(title, " (", release_year, ")"),collection_in_mil
FROM movies
ORDER BY collection_in_mil DESC
LIMIT 5
"""
cursor.execute(select_movies_query)
for movie in cursor.fetchall():
    print(movie)

('Avengers: Endgame (2019)', Decimal('858.8'))
('Titanic (1997)', Decimal('659.2'))
('The Dark Knight (2008)', Decimal('535.4'))
('Toy Story 4 (2019)', Decimal('434.9'))
('The Lion King (1994)', Decimal('423.6'))

One of the reviewers named Amy Farah Fowler is now married to Sheldon Cooper. Her last name has changed and it has to be updated in the table.

In [21]:
cursor.execute("Select * from reviewers WHERE first_name = 'Amy'")
print(cursor.fetchall())

[(21, 'Amy', 'Farah Fowler')]

In [22]:
update_query = """
UPDATE
    reviewers
SET
    last_name = "Cooper"
WHERE
    first_name = "Amy"
"""
cursor.execute(update_query)
cursor.execute("Select * from reviewers WHERE first_name = 'Amy'")
print(cursor.fetchall())

[(21, 'Amy', 'Cooper')]

### Let us now see how to parse JSON data into a file.

In [ ]:
import mysql.connector
from mysql.connector import Error

connection = mysql.connector.connect(host='localhost',
                                         database='employees',
                                         user='root',
                                         password='')

if connection.is_connected():
        db_Info = connection.get_server_info()
        print("Connected to MySQL Server version ", db_Info)
        cursor = connection.cursor()
        cursor.execute("select database();")
        record = cursor.fetchone()
        print("You're connected to database: ", record)

In [24]:
mySql_Select_Table_Query = "select * from employee;"
cursor = connection.cursor()
cursor.execute(mySql_Select_Table_Query)
records = cursor.fetchall()
print("Total number of rows in table: ", cursor.rowcount)
print("Query created successfully ")
print(records)
print(type(records))

Total number of rows in table:  2
Query created successfully
[('Tom', 'Manager', '40', '10000'), ('Harry', 'Leader', '35', '8000')]
<class 'list'>

In [25]:
class create_dict(dict): 
  
    # __init__ function 
    def __init__(self): 
        self = dict() 
          
    # Function to add key:value 
    def add(self, key, value): 
        self[key] = value

mydict = create_dict()
for row in records:
    mydict.add(row[0],({"designation":row[1],"age":row[2],"salary":row[3]}))

print(mydict)

{'Tom': {'designation': 'Manager', 'age': '40', 'salary': '10000'}, 'Harry': {'designation': 'Leader', 'age': '35', 'salary': '8000'}}

In [26]:
import json
  
# create a JSON file

out_file = open("sql_json_file.json1", "w")
  
json.dump(mydict, out_file, indent = 3)
  
out_file.close()

### Conclusion:
This demonstration teaches how to-
1. Connect your Python App with a MySQL Database.
2. Bring data from MySQL database into Python for further analysis.
3. Execute SQL queries from your Python application.
4. Handle exceptions while accessing the database.